# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)


"""
    # Задачі 07 - 10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apples_tree = 4
pear_tree = apples_tree + 5
plum_tree =  apples_tree - 2
all_the_trees_in_garden = apples_tree + plum_tree + pear_tree
print(all_the_trees_in_garden)

#####################################################################################
#Если на языке понятном второкласснику:
#####################################################################################
яблонь = 4
груш = яблонь + 5 #Груш на 5 штук больше чем яблонь. К ялоням мы прибавляем 5
слив = яблонь - 2 #Слив на две меньше чем яблонь. От яблонь мы отнимаем 2
деревья_в_саду = яблонь + груш + слив #Скадываем все дерерья в саду.
print("Яблок, груш и слив в саду", деревья_в_саду)

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
morning_temperature = 0 + 5
afternoon_temperature = morning_temperature - 10
evening_temperature = afternoon_temperature + 4
print(evening_temperature)
#####################################################################################
#Если на языке понятном второкласснику:
#####################################################################################
температура_утром = 0 + 5 # На 5 выше нуля. Значит к 0 мы прибавляем 5. Получаем 5
температура_в_полдник = температура_утром - 10 # После обеда температура опустилась на 10 градусов.
#Значит от температуры утром мы отнимаем 10. Получаем -5
температура_вечером = температура_в_полдник + 4 #К температура в полдник мы добавляем 4.
# Так как стало на 4 градусе теплее
print("Температура вечером:", температура_вечером)
# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
all_boys = 24
all_girls = 24 / 2
boys_today = 24 -1
girls_today = all_girls - 2
childrens_today = boys_today + girls_today
print("Детей всего сегодня:", int(childrens_today)) #Убрал дробную часть, чтобы детей получилось целое количество, без точка ноль.
# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
first_book_price =  8
second_book_price  = 8 + 2
third_book_price = (first_book_price + second_book_price) / 2
all_books_price  = first_book_price + second_book_price + third_book_price
print("Цена за все книги составила:", all_books_price)
