#Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі).
# Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".


#Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
#Ви можете перевірити це в інкогніто-режимі вашого браузера.
#Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код.

user_word = input("Пожалуйста введите слово")
chek_for_h = user_word.lower().find("h")

while chek_for_h == -1:
    user_word = input("Пожалуйста, введите слово, в котором есть буква 'h': ")
    chek_for_h = user_word.lower().find("h")

print(f"Спасибо! Слово {user_word} подходит")



#Второй вариант решения, с break
while True:
    user_word = input("Пожалуйста, введите слово, в котором есть буква 'h': ")
    if 'h' in user_word:
        print(f"Спасибо! Слово '{user_word}' подходит")
        break